app/controllers/events_controller.rb

SELECT `events`.* FROM `events`  WHERE `events`.`id` IN ('all', '---\n:conditions:\n  :user_id: !ruby/object:User\n    attributes:\n      id: 1\n      email: asdf@asdf.com\n      encrypted_password: \"$2a$10$N5JYvA6gbkm9J3HlE/HaWOQpWRuJAF5S.Vd6e8IfIhCa.j.54Z4Vm\"\n      reset_password_token: \n      reset_password_sent_at: \n      remember_created_at: \n      sign_in_count: 4\n      current_sign_in_at: 2014-07-10 14:09:46.000000000 Z\n      last_sign_in_at: 2014-07-10 14:05:38.000000000 Z\n      current_sign_in_ip: 127.0.0.1\n      last_sign_in_ip: 127.0.0.1\n      created_at: 2014-07-09 21:28:06.000000000 Z\n      updated_at: 2014-07-10 14:09:46.000000000 Z\n')
---
  def index
    @events = Event.where(:user_id => current_user)

INSERT INTO `events` (`created_at`, `description`, `end_time`, `start_time`, `title`, `updated_at`) VALUES ('2014-07-09 20:51:06', 'sdfasdfsadf', '2014-07-09 20:50:00', '2014-07-09 20:50:00', 'asdf', '2014-07-09 20:51:06')
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

SELECT  `events`.* FROM `events`  WHERE `events`.`id` = 1 LIMIT 1
---
    def set_event
      @event = Event.find(params[:id])